##################################################################################################################################

# Elston and Grizzle (1962) 는 치의학 연구를 위해 20명의 소년들의
# ramus bone을 4 번 (8, 8.5, 9, 9.5세) 에 걸쳐 mm단위로 측정

# Q: 나이에 따라 뼈의 길이가 변하는가?
# Q: 변한다면 길이의 변화가 선형인가?

##################################################################################################################################

# 방법 1 : 행렬 계산

# Data Loading
ramus = read.csv("./ramus.csv")

# Matrix로 변환
ramus = ramus[,-1]

# 공분산 행렬
C = matrix(c(1, -1,  0,  0,
             0,  1, -1,  0,
             0,  0,  1, -1), ncol = 4, byrow = T)

# 
ad.ramus = as.data.frame(as.matrix(ramus) %*% t(C))

# Hotellings T 검정 (다변량 정규분포를 가정)
library(ICSNP)
HotellingsT2(ad.ramus, test="f")

# Hotellings T 검정 (다변량 정규분포를 만족하지 못하는 경우)
HotellingsT2(ad.ramus, test="chi")

##################################################################################################################################

# 방법 2 : Y를 직접 계산하는 방법

# Data Loading
ramus = read.csv("./ramus.csv")
ramus = ramus[,-1]

# 변수 생성
attach(ramus)
   df1 = age8 - age8.5
   df2 = age8 - age9
   df3 = age8 - age9.5
detach(ramus)
   
# 데이터프레임으로 변환
ad2.ramus = data.frame(df1, df2, df3)

# Hotellings T 검정
HotellingsT2(ad2.ramus, test="f")

##################################################################################################################################
